SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F30x.h
#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE != TURN_OFF)
#error "Error: LOW_SIDE_IDLE_STATE in Driver parameters.h must be TURN_OFF."
#endif

#if !defined(LOW_SIDE_BRAKE_STATE)
#define LOW_SIDE_BRAKE_STATE TURN_OFF
#endif

#if (LOW_SIDE_BRAKE_STATE == TURN_OFF)
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_UL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_UL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_UL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_UL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_BRAKE_STATE == TURN_OFF)
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_VL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_VL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_VL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_VL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_BRAKE_STATE == TURN_OFF)
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_WL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_WL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_BRAKE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define BRAKE_WL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define BRAKE_WL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#define PWM_TIM1 0x1 /* Dummy value for comparison */
#define PWM_TIM8 0x8 /* Dummy value for comparison */
#if (PWM_TIMER_SELECTION == PWM_TIM1)
#define TIMx_UP_M1_IRQHandler TIM1_UP_TIM16_IRQHandler
#define TIMx_UP_M1_IRQFlag 0
#define TIMx_BRK_M1_IRQHandler TIM1_BRK_TIM15_IRQHandler
#endif
#if (PWM_TIMER_SELECTION == PWM_TIM8)
#define TIMx_UP_M1_IRQHandler TIM8_UP_IRQHandler
#define TIMx_UP_M1_IRQFlag 1
#define TIMx_BRK_M1_IRQHandler TIM8_BRK_IRQHandler
#define MC1USETIM8
#endif
#undef PWM_TIM1
#undef PWM_TIM8

#define PWM_TIM1			TIM1
#define PWM_TIM8                        TIM8
#define PWM_NO_REMAP		0 //Dummy
#define PWM_FULL_REMAP 		0 //Dummy
#define PWM_PARTIAL_REMAP 	0 //

/**********  AUXILIARY TIMER (SINGLE SHUNT) *************/
#if (defined STM32PERFORMANCELD || defined STM32VALUELD)
#define R1_PWM_AUX_TIM                  TIM3
#else
#define R1_PWM_AUX_TIM                  TIM4
#endif

/**********  SPEED FEEDBACK TIMERS SETTING *************/
#if (defined(HALL_SENSORS) || defined(AUX_HALL_SENSORS))
  #if (HALL_TIMER_SELECTION == HALL_TIM2)
  #define HALL_TIMER 				TIM2  
  #define HALL_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
  #define HALL_IRQ_CHANNEL  		TIM2_IRQn
  #elif (HALL_TIMER_SELECTION == HALL_TIM3)
  #define HALL_TIMER 				TIM3  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM3
  #define HALL_IRQ_CHANNEL  		TIM3_IRQn  
  #elif (HALL_TIMER_SELECTION == HALL_TIM4)
  #define HALL_TIMER 				TIM4  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM4  
  #define HALL_IRQ_CHANNEL  		TIM4_IRQn
  #elif (HALL_TIMER_SELECTION == HALL_TIM5)
  #define HALL_TIMER 				TIM5  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM5
  #define HALL_IRQ_CHANNEL  		TIM5_IRQn  
  #else
  #error "Hall parameters not defined in Control Stage parametes.h"
  #endif
#else
  /* Dummy value to avoid compiler error */
  #undef HALL_TIMER
  #undef HALL_TIMER_REMAPPING
  #undef HALL_RCC_PERIPHERAL
  #undef HALL_IRQ_CHANNEL
  #undef H1_GPIO_PORT
  #undef H2_GPIO_PORT
  #undef H3_GPIO_PORT
  #undef H1_GPIO_PIN
  #undef H2_GPIO_PIN
  #undef H3_GPIO_PIN
  #define HALL_TIMER 				    TIM2
  #define HALL_TIMER_REMAPPING  NO_REMAP_TIM2
  #define HALL_RCC_PERIPHERAL		RCC_APB1Periph_TIM2
  #define HALL_IRQ_CHANNEL  		TIM2_IRQn
  #define H1_GPIO_PORT          GPIOA
  #define H2_GPIO_PORT          GPIOA
  #define H3_GPIO_PORT          GPIOA
  #define H1_GPIO_PIN           GPIO_Pin_0
  #define H2_GPIO_PIN           GPIO_Pin_1
  #define H3_GPIO_PIN           GPIO_Pin_2
#endif

#if (defined(ENCODER) || defined(AUX_ENCODER))
  #if (ENC_TIMER_SELECTION == ENC_TIM2)
  #define ENC_TIMER 				TIM2  
  #define ENC_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
  #define ENC_IRQ_CHANNEL  		TIM2_IRQn
  #elif (ENC_TIMER_SELECTION == ENC_TIM3)
  #define ENC_TIMER 				TIM3  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM3
  #define ENC_IRQ_CHANNEL  		TIM3_IRQn  
  #elif (ENC_TIMER_SELECTION == ENC_TIM4)
  #define ENC_TIMER 				TIM4  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM4  
  #define ENC_IRQ_CHANNEL  		TIM4_IRQn
  #elif (ENC_TIMER_SELECTION == ENC_TIM5)
  #define ENC_TIMER 				TIM5  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM5
  #define ENC_IRQ_CHANNEL  		TIM5_IRQn  
  #else
  #error "Encoder parameters not defined in Control Stage parametes.h"
  #endif
#else
  /* Dummy value to avoid compiler error */
  #undef  ENC_TIMER
  #undef  ENC_TIMER_REMAPPING
  #undef  ENC_RCC_PERIPHERAL
  #undef  ENC_IRQ_CHANNEL
  #undef  ENC_A_GPIO_PORT
  #undef  ENC_B_GPIO_PORT
  #undef  ENC_A_GPIO_PIN
  #undef  ENC_B_GPIO_PIN

  #define ENC_TIMER 				    TIM2
  #define ENC_TIMER_REMAPPING   NO_REMAP_TIM2
  #define ENC_RCC_PERIPHERAL		RCC_APB1Periph_TIM2
  #define ENC_IRQ_CHANNEL  		  TIM2_IRQn
  #define ENC_A_GPIO_PORT       GPIOA
  #define ENC_B_GPIO_PORT       GPIOA
  #define ENC_A_GPIO_PIN        GPIO_Pin_0
  #define ENC_B_GPIO_PIN        GPIO_Pin_1
#endif

/* Resistive Brake */
#if (ON_OVER_VOLTAGE != TURN_ON_R_BRAKE)
  /* Dummy value to avoid compiler error */
  #undef R_BRAKE_GPIO_PORT
  #undef R_BRAKE_GPIO_PIN
  
  #define R_BRAKE_GPIO_PORT     GPIOD
  #define R_BRAKE_GPIO_PIN      GPIO_Pin_13
#endif

/* Hardware over current protection bypass */
#if (HW_OV_CURRENT_PROT_BYPASS != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef OV_CURR_BYPASS_GPIO_PORT
  #undef OV_CURR_BYPASS_GPIO_PIN
  
