SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F30x.h
/* Encoder alignment */
#define T_ALIGNMENT              ALIGNMENT_DURATION
#define ALIGNMENT_ANGLE_S16      (int16_t)  (ALIGNMENT_ANGLE_DEG*65536u/360u)

/*************** Timer for speed/position feedback   ******/
#define FULL_REMAP_TIM2			GPIO_FullRemap_TIM2
#define PARTIAL_REMAP_01_TIM2		GPIO_PartialRemap1_TIM2
#define PARTIAL_REMAP_10_TIM2		GPIO_PartialRemap2_TIM2
#define NO_REMAP_TIM2                   GPIO_NoRemap_TIMx

#define FULL_REMAP_TIM3			GPIO_FullRemap_TIM3
#define PARTIAL_REMAP_TIM3		GPIO_PartialRemap_TIM3
#define NO_REMAP_TIM3                   GPIO_NoRemap_TIMx

#define REMAP_TIM4			GPIO_Remap_TIM4
#define NO_REMAP_TIM4                   GPIO_NoRemap_TIMx

#define NO_REMAP_TIM5                   GPIO_NoRemap_TIMx


/*************** Timer for PWM generation & currenst sensing parameters  ******/
#define PWM_PERIOD_CYCLES (uint16_t)(ADV_TIM_CLK_MHz*\
                                      (unsigned long long)1000000u/((uint16_t)(PWM_FREQUENCY)))

#if ((LOW_SIDE_SIGNALS_ENABLING == ENABLE)||(LOW_SIDE_SIGNALS_ENABLING == LS_PWM_TIMER_VAL))
#define DEADTIME_NS  SW_DEADTIME_NS
#else
#define DEADTIME_NS  HW_DEAD_TIME_NS
#endif

#define DEAD_TIME_ADV_TIM_CLK_MHz (ADV_TIM_CLK_MHz * TIM_CLOCK_DIVIDER)
#define DEAD_TIME_COUNTS_1  (DEAD_TIME_ADV_TIM_CLK_MHz * DEADTIME_NS/1000uL)

#if (DEAD_TIME_COUNTS_1 <= 255)
  #define DEAD_TIME_COUNTS (uint16_t) DEAD_TIME_COUNTS_1
#elif (DEAD_TIME_COUNTS_1 <= 508)
  #define DEAD_TIME_COUNTS (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz * DEADTIME_NS/2) /1000uL) + 128)
  #elif (DEAD_TIME_COUNTS_1 <= 1008)
    #define DEAD_TIME_COUNTS (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz * DEADTIME_NS/8) /1000uL) + 320)
    #elif (DEAD_TIME_COUNTS_1 <= 2015)
      #define DEAD_TIME_COUNTS (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz * DEADTIME_NS/16) /1000uL) + 384)
      #else
        #define DEAD_TIME_COUNTS 510
#endif

#define DTCOMPCNT (uint16_t)((DEADTIME_NS * ADV_TIM_CLK_MHz) / 2000)
#define TON_NS  500
#define TOFF_NS 500
#define TON  (uint16_t)((TON_NS * ADV_TIM_CLK_MHz)  / 2000)
#define TOFF (uint16_t)((TOFF_NS * ADV_TIM_CLK_MHz) / 2000)

#if (TNOISE_NS > TRISE_NS)
  #define MAX_TNTR_NS TNOISE_NS
#else
  #define MAX_TNTR_NS TRISE_NS
#endif


#define SAMPLING_TIME_NS (((CURR_SAMPLING_TIME) * 1000uL/ADC_CLK_MHz)+(7000uL/(2*ADC_CLK_MHz)))

#if (CURR_SAMPLING_TIME == 1)
#define SAMPLING_TIME_SEL  ADC_SampleTime_1Cycles5
#elif (CURR_SAMPLING_TIME == 2)
#define SAMPLING_TIME_SEL  ADC_SampleTime_2Cycles5
#elif (CURR_SAMPLING_TIME == 4)
#define SAMPLING_TIME_SEL  ADC_SampleTime_4Cycles5
#elif (CURR_SAMPLING_TIME == 7)
#define SAMPLING_TIME_SEL  ADC_SampleTime_7Cycles5
#elif (CURR_SAMPLING_TIME == 19)
#define SAMPLING_TIME_SEL  ADC_SampleTime_19Cycles5
#elif (CURR_SAMPLING_TIME == 61)
#define SAMPLING_TIME_SEL  ADC_SampleTime_61Cycles5
#elif (CURR_SAMPLING_TIME == 181)
#define SAMPLING_TIME_SEL  ADC_SampleTime_181Cycles5
#elif (CURR_SAMPLING_TIME == 601)
#define SAMPLING_TIME_SEL  ADC_SampleTime_601Cycles5
#endif

#define SAMPLING_TIME (uint16_t)(((uint16_t)(SAMPLING_TIME_NS) * ADV_TIM_CLK_MHz)/1000uL) 
#define TRISE (uint16_t)((((uint16_t)(TRISE_NS)) * ADV_TIM_CLK_MHz)/1000uL)
#define TDEAD (uint16_t)((DEADTIME_NS * ADV_TIM_CLK_MHz)/1000uL)

#define TMIN (((uint16_t)(((DEADTIME_NS+((uint16_t)(TRISE_NS))+\
			 ((uint16_t)(SAMPLING_TIME_NS)))*ADV_TIM_CLK_MHz)/1000ul))+1)
#define HTMIN (uint16_t)(TMIN >> 1)
#define CHTMIN (uint16_t)(TMIN/(REGULATION_EXECUTION_RATE*2))
#define TSAMPLE SAMPLING_TIME
#define TAFTER ((uint16_t)(((DEADTIME_NS+((uint16_t)(TRISE_NS)))\
												   *ADV_TIM_CLK_MHz)/1000ul))
#define TBEFORE (((uint16_t)(((((u16)(SAMPLING_TIME_NS)))\
											*ADV_TIM_CLK_MHz)/1000ul))+1)

#if (TRISE_NS > SAMPLING_TIME_NS)
  #define MAX_TRTS (2 * TRISE)
#else
  #define MAX_TRTS (2 * SAMPLING_TIME)
#endif

#define TNOISE (u16)((((u16)(TNOISE_NS)) * ADV_TIM_CLK_MHz)/1000uL)

#if (TNOISE_NS > TRISE_NS)
  #define MAX_TNTR_NS TNOISE_NS
#else
  #define MAX_TNTR_NS TRISE_NS
#endif

#define TW_AFTER ((uint16_t)(((DEADTIME_NS+MAX_TNTR_NS)*ADV_TIM_CLK_MHz)/1000ul))
#define TW_BEFORE (((uint16_t)(((((uint16_t)(SAMPLING_TIME_NS)))*ADV_TIM_CLK_MHz)/1000ul))+1u)
#define ADC_CONV_NB_CK 13u
#define TW_BEFORE_R3_1 (((uint16_t)(((((uint16_t)(SAMPLING_TIME_NS * 2)))*ADV_TIM_CLK_MHz)/1000ul))+ 1u + ADC_CONV_NB_CK)

#if (FLUX_WEAKENING_ENABLING == ENABLE)
#define FLUX_WEAKENING
#endif
#if (MTPA_ENABLING == ENABLE)
#define IPMSM_MTPA
#endif

#if (FEED_FORWARD_CURRENT_REG_ENABLING == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION
#endif

#ifdef MAX_MODULATION_81_PER_CENT
#define START_INDEX     41
#define MAX_MODULE      26541   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*81% 
#define MMITABLE {\
32508,32255,32008,31530,31299,30852,30636,30216,30012,29617,29426,29053,28872,\
28520,28349,28015,27853,27536,27382,27081,26934,26647,26507,26234,26101,25840,\
25712,25462,25340,25101,24984,24755,24643,24422,24315,24103,24000,23796,23696,\
23500,23404,23216,23123,22941,22851,22763,22589,22504,22336,22253,22091,22011,\
21854,21776,21624,21549,21401,21329,21186,21115,20976,20908,20773,20706,20575,\
20511,20383,20320,20196,20135,20015,19955,19838,19780,19666,19609,19498,19443,\
19334,19280,19175,19122,19019,18968,18867,18817,18719\
}
#endif

#ifdef MAX_MODULATION_83_PER_CENT
#define START_INDEX     44
#define MAX_MODULE      27196   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*83% 
#define MMITABLE {\
32291,32060,31613,31397,30977,30573,30377,29996,29811,29451,29276,28934,28768,\
28444,28286,27978,27827,27533,27390,27110,26973,26705,26574,26318,26069,25948,\
25709,25592,25363,25251,25031,24923,24711,24607,24404,24304,24107,24011,23821,\
23728,23545,23456,23279,23192,23021,22854,22772,22610,22530,22374,22297,22145,\
22070,21922,21850,21707,21636,21497,21429,21294,21227,21096,21032,20904,20778,\
20717,20595,20534,20416,20357,20241,20184,20071,20015,19905,19851,19743,19690,\
19585,19533,19431,19380,19280,19182\
}
#endif


#ifdef MAX_MODULATION_85_PER_CENT
#define START_INDEX     46
#define MAX_MODULE      27851   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*85%  
#define MMITABLE {\
32324,32109,31691,31489,31094,30715,30530,30170,29995,29654,29488,29163,29005,\
28696,28397,28250,27965,27825,27552,27418,27157,26903,26779,26535,26416,26182,\
26067,25842,25623,25515,25304,25201,24997,24897,24701,24605,24415,24230,24139,\
23960,23872,23699,23614,23446,23282,23201,23042,22964,22810,22734,22584,22437,\
22365,22223,22152,22014,21945,21811,21678,21613,21484,21421,21296,21234,21112,\
21051,20932,20815,20757,20643,20587,20476,20421,20312,20205,20152,20048,19996\
,19894,19844,19744,19645\
}
#endif



#ifdef MAX_MODULATION_87_PER_CENT
#define START_INDEX     48
#define MAX_MODULE      28507   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*87%  
#define MMITABLE {\
32559,32154,31764,31575,31205,31025,30674,30335,30170,29847,\
29689,29381,29083,28937,28652,28375,28239,27974,27844,27589,\
27342,27220,26983,26866,26637,26414,26305,26090,25984,25777,\
25575,25476,25280,25184,24996,24811,24720,24542,24367,24281,\
24112,24028,23864,23703,23624,23468,23391,23240,23091,23018,\
22874,22803,22662,22524,22456,22322,22191,22126,21997,21934,\
21809,21686,21625,21505,21446,21329,21214,21157,21045,20990,\
20880,20772,20719,20613,20561,20458,20356,20306,20207,20158,\
20109\
}
#endif

#ifdef MAX_MODULATION_89_PER_CENT
#define START_INDEX     50
#define MAX_MODULE      29162   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*89%
#define MMITABLE {\
32574,32197,32014,31656,31309,31141,30811,30491,30335,30030,\
29734,29589,29306,29031,28896,28632,28375,28249,28002,27881,\
27644,27412,27299,27076,26858,26751,26541,26336,26235,26037,\
25844,25748,25561,25378,25288,25110,24936,24851,24682,24517,\
24435,24275,24118,24041,23888,23738,23664,23518,23447,23305,\
23166,23097,22962,22828,22763,22633,22505,22442,22318,22196,\
22135,22016,21898,21840,21726,21613,21557,21447,21338,21284,\
21178,21074,21022,20919,20819,20769,20670,20573\
}
#endif

#ifdef MAX_MODULATION_91_PER_CENT
#define START_INDEX     52
#define MAX_MODULE      29817   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*91%
#define MMITABLE {\
32588,32411,32066,31732,31569,31250,30940,30789,30492,30205,\
29925,29788,29519,29258,29130,28879,28634,28395,28278,28048,\
27823,27713,27497,27285,27181,26977,26777,26581,26485,26296,\
26110,26019,25840,25664,25492,25407,25239,25076,24995,24835,\
24679,24602,24450,24301,24155,24082,23940,23800,23731,23594,\
23460,23328,23263,23135,23008,22946,22822,22701,22641,22522,\
22406,22291,22234,22122,22011,21956,21848,21741,21636,21584,\
21482,21380,21330,21231,21133,21037\
}
#endif


#ifdef MAX_MODULATION_92_PER_CENT
#define START_INDEX     54
#define MAX_MODULE      30145   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*92%
#define MMITABLE {\
32424,32091,31929,31611,31302,31002,30855,30568,30289,30017,\
29884,29622,29368,29243,28998,28759,28526,28412,28187,27968,\
27753,27648,27441,27238,27040,26942,26750,26563,26470,26288,\
26110,25935,25849,25679,25513,25350,25269,25111,24955,24803,\
24727,24579,24433,24361,24219,24079,23942,23874,23740,23609,\
23479,23415,23289,23165,23042,22982,22863,22745,22629,22572,\
22459,22347,22292,22183,22075,21970,21917,21813,21711,21610,\
21561,21462,21365,21268\
}
#endif


