SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F30x.h
#if (LOG2(PLL_KPDIV)==-1)
  #error "Error: PLL_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define PLL_KPDIV_LOG LOG2(PLL_KPDIV)
#endif

#if (LOG2(PLL_KIDIV)==-1)
  #error "Error: PLL_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define PLL_KIDIV_LOG LOG2(PLL_KIDIV)
#endif

#if (LOG2(F1)==-1)
  #error "Error: F1 defined in Drive parameters.h must be power of two."
#else
  #define F1_LOG LOG2(F1)
#endif

#if (LOG2(F2)==-1)
  #error "Error: F2 defined in Drive parameters.h must be power of two."
#else
  #define F2_LOG LOG2(F2)
#endif

#if (LOG2(STO_FIFO_DEPTH_DPP)==-1)
  #error "Error: STO_FIFO_DEPTH_DPP in Drive parameters.h must be power of two."
#else
  #define STO_FIFO_DEPTH_DPP_LOG LOG2(STO_FIFO_DEPTH_DPP)
#endif

#if (LOG2(CORD_FIFO_DEPTH_DPP)==-1)
  #error "Error: CORD_FIFO_DEPTH_DPP in Drive parameters.h must be power of two."
#else
  #define CORD_FIFO_DEPTH_DPP_LOG LOG2(CORD_FIFO_DEPTH_DPP)
#endif

#if (LOG2(HFI_PID_KPDIV)==-1)
  #error "Error: HFI_PID_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KPDIV_LOG LOG2(HFI_PID_KPDIV)
#endif

#if (LOG2(HFI_PID_KIDIV)==-1)
  #error "Error: HFI_PID_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KIDIV_LOG LOG2(HFI_PID_KIDIV)
#endif

#if (BUS_VOLTAGE_READING == ENABLE)
 #if ((OV_VOLTAGE_PROT_ENABLING != ENABLE) || (UV_VOLTAGE_PROT_ENABLING!= ENABLE))
  #error "Configuration not supported by this version of the library. Under and Over voltage protections (motor 1) must be enabled if bus voltage sensing is enabled."
 #else
  #define BUS_VOLTAGE_MEASUREMENT
 #endif
#endif

#if ((TEMPERATURE_READING == ENABLE) && (OV_TEMPERATURE_PROT_ENABLING == ENABLE))
 #define HEAT_SINK_TEMPERATURE_MEASUREMENT
#endif

#define VIRTUAL_HEAT_SINK_TEMPERATURE_VALUE   25u

#define TEMP_SW_FILTER_BW_FACTOR      250u
#define VQD_SW_FILTER_BW_FACTOR       128u
#define VBUS_SW_FILTER_BW_FACTOR      6u

#if (LOG2(VQD_SW_FILTER_BW_FACTOR)==-1)
  #error "Error: VQD_SW_FILTER_BW_FACTOR defined in Drive parameters.h must be power of two."
#else
  #define VQD_SW_FILTER_BW_FACTOR_LOG LOG2(VQD_SW_FILTER_BW_FACTOR)
#endif

#if (VBUS_ADC_SAMPLING_TIME == 1)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_1Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 2)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_2Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 4)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_4Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 7)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_7Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 19)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_19Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 61)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_61Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 181)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_181Cycles5
#elif (VBUS_ADC_SAMPLING_TIME == 601)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_601Cycles5
#else
#define VBUS_SAMPLING_TIME  ADC_SampleTime_1Cycles5
#endif

#if (TEMP_ADC_SAMPLING_TIME == 1)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_1Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 2)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_2Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 4)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_4Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 7)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_7Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 19)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_19Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 61)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_61Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 181)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_181Cycles5
#elif (TEMP_ADC_SAMPLING_TIME == 601)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_601Cycles5
#else
#define TEMP_SAMPLING_TIME  ADC_SampleTime_1Cycles5
#endif

#if ((defined STATE_OBSERVER_PLL) || (defined STATE_OBSERVER_CORDIC))
#define NO_SPEED_SENSORS
#endif

#if LCD_JOYSTICK_FUNCTIONALITY == ENABLE
#define LCD_FUNCTIONALITY
#endif

#if (defined STM32PERFORMANCEMD) || (defined STM32PERFORMANCELD)
#define STM32PERFORMANCE
#endif
#if defined STM32PERFORMANCEHD 
#define STM32HD
#endif
#if (defined STM32VALUEMD) || (defined STM32VALUELD)
#define STM32VALUE
#endif

#if (MTPA_ENABLING == ENABLE)
#define IPMSM_MTPA
#endif

#if (FEED_FORWARD_CURRENT_REG_ENABLING == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION
#endif

#if (FLUX_WEAKENING_ENABLING == ENABLE)
#define FLUX_WEAKENING
#endif

#if defined AUX_ENCODER
#define VIEW_ENCODER_FEEDBACK
#endif

#if defined AUX_HALL_SENSORS
#define VIEW_HALL_FEEDBACK
#endif

#if (DAC_FUNCTIONALITY == DISABLE)
#undef DAC_FUNCTIONALITY
#endif

#if (SERIAL_COMMUNICATION == DISABLE)
#undef SERIAL_COMMUNICATION
#endif

/* Number of MC object */

#ifdef SINGLEDRIVE
  #define MC_NUM 1
#endif

#ifdef DUALDRIVE
  #define MC_NUM 2
#endif

#if (defined(SINGLE_SHUNT) || defined(THREE_SHUNT) || defined(THREE_SHUNT_INDEPENDENT_RESOURCES) || defined(THREE_SHUNT_SHARED_RESOURCES))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * RSHUNT * AMPLIFICATION_GAIN ))
#endif

#if (defined(ICS_SENSORS))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * AMPLIFICATION_GAIN ))
#endif

/*********************** Usart remapping  ***********************/
#define USE_USART1 0
#define USE_USART2 1
#define USE_USART3 2
#define USE_USART4 3
#define USE_USART5 4

/* Dummy */
#define NO_REMAP_USART1       0
#define REMAP_USART1          1
#define NO_REMAP_USART2       2
#define REMAP_USART2          3
#define NO_REMAP_USART3       4
#define FULL_REMAP_USART3     5
#define PARTIAL_REMAP_USART3  6

#define GPIO_NoRemap_USARTx 0

#if (USART_SELECTION == USE_USART1)
  #define USART                   USART1
  #define USART_CLK               RCC_APB2Periph_USART1
  #define USART_IRQ               USART1_IRQn
  #define USART_IRQHandler        USART1_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#if (USART_SELECTION == USE_USART2)
  #define USART                   USART2
  #define USART_CLK               RCC_APB1Periph_USART2
  #define USART_IRQ               USART2_IRQn
  #define USART_IRQHandler        USART2_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

#if (USART_SELECTION == USE_USART3)
  #define USART                   USART3
  #define USART_CLK               RCC_APB1Periph_USART3
  #define USART_IRQ               USART3_IRQn
  #define USART_IRQHandler        USART3_IRQHandler
  /* Dummy */
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx
#endif

