SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F30x.h
#define COMP1_InvertingInput_PA0    COMP_InvertingInput_IO1
#define COMP2_InvertingInput_PA2    COMP_InvertingInput_IO1
#define COMP3_InvertingInput_PD15   COMP_InvertingInput_IO1
#define COMP3_InvertingInput_PB12   COMP_InvertingInput_IO2
#define COMP4_InvertingInput_PE8    COMP_InvertingInput_IO1
#define COMP4_InvertingInput_PB2    COMP_InvertingInput_IO2
#define COMP5_InvertingInput_PD13   COMP_InvertingInput_IO1
#define COMP5_InvertingInput_PB10   COMP_InvertingInput_IO2
#define COMP6_InvertingInput_PD10   COMP_InvertingInput_IO1
#define COMP6_InvertingInput_PB15   COMP_InvertingInput_IO2
#define COMP7_InvertingInput_PC0    COMP_InvertingInput_IO1

#define COMPX_InvertingInput_DAC1      COMP_InvertingInput_DAC1OUT1
#define COMPX_InvertingInput_DAC2      COMP_InvertingInput_DAC1OUT2
#define COMPX_InvertingInput_VREF      COMP_InvertingInput_VREFINT
#define COMPX_InvertingInput_VREF_1_4  COMP_InvertingInput_1_4VREFINT
#define COMPX_InvertingInput_VREF_1_2  COMP_InvertingInput_1_2VREFINT
#define COMPX_InvertingInput_VREF_3_4  COMP_InvertingInput_3_4VREFINT

#define COMP1_NonInvertingInput_PA1   COMP_NonInvertingInput_IO1
#define COMP2_NonInvertingInput_PA3   COMP_NonInvertingInput_IO2
#define COMP2_NonInvertingInput_PA7   COMP_NonInvertingInput_IO1
#define COMP3_NonInvertingInput_PB14  COMP_NonInvertingInput_IO1
#define COMP3_NonInvertingInput_PD14  COMP_NonInvertingInput_IO2
#define COMP4_NonInvertingInput_PB0   COMP_NonInvertingInput_IO1
#define COMP4_NonInvertingInput_PE7   COMP_NonInvertingInput_IO2
#define COMP5_NonInvertingInput_PB13  COMP_NonInvertingInput_IO2
#define COMP5_NonInvertingInput_PD12  COMP_NonInvertingInput_IO1
#define COMP6_NonInvertingInput_PB11  COMP_NonInvertingInput_IO2
#define COMP6_NonInvertingInput_PD11  COMP_NonInvertingInput_IO1
#define COMP7_NonInvertingInput_PC1   COMP_NonInvertingInput_IO2
#define COMP7_NonInvertingInput_PA0   COMP_NonInvertingInput_IO1

#if (USE_INTERNAL_OPAMP == ENABLE)
#define R3_4_OPAMPPARAMSM1 &R3_4_F30XOPAMPParamsM1
#define R3_2_OPAMPPARAMSM1 &R3_2_F30XOPAMPParamsM1
#define R1_OPAMPPARAMSM1   &R1_F30XOPAMPParamsM1
#else
#define R3_4_OPAMPPARAMSM1 MC_NULL
#define R3_2_OPAMPPARAMSM1 MC_NULL
#define R1_OPAMPPARAMSM1   MC_NULL
#endif

#if (INTERNAL_OVERCURRENTPROTECTION == ENABLE)
#define OCPA_COMPPARAMSM1 &R3_F30XOCPACOMPParamsM1
#define OCPB_COMPPARAMSM1 &R3_F30XOCPBCOMPParamsM1
#define OCPC_COMPPARAMSM1 &R3_F30XOCPCCOMPParamsM1
#define OCP_COMPPARAMSM1  &R1_F30XOCPCOMPParamsM1
#else
#define OCPA_COMPPARAMSM1 MC_NULL
#define OCPB_COMPPARAMSM1 MC_NULL
#define OCPC_COMPPARAMSM1 MC_NULL
#define OCP_COMPPARAMSM1  MC_NULL
#endif

#if (INTERNAL_OVERVOLTAGEPROTECTION == ENABLE)
#define OVP_COMPPARAMSM1 &F30XOVPCOMPParamsM1
#else
#define OVP_COMPPARAMSM1 MC_NULL
#endif

#if (defined(DUALDRIVE) && (defined(SINGLE_SHUNT) || defined(THREE_SHUNT_INDEPENDENT_RESOURCES)))
#define ADC1_2_DUALDRIVEFIFOUPDATE TSK_DualDriveFIFOUpdate(Exec_IRQ_Handler(MC_IRQ_PWMNCURRFDBK_1,TIMx_UP_M1_IRQFlag))
#define ADC3_DUALDRIVEFIFOUPDATE TSK_DualDriveFIFOUpdate(Exec_IRQ_Handler(MC_IRQ_PWMNCURRFDBK_2,TIMx_UP_M2_IRQFlag))
#else
#define ADC1_2_DUALDRIVEFIFOUPDATE
#define ADC3_DUALDRIVEFIFOUPDATE
#endif

/*******************************************************************************
The following block shall be removed when future version of WB will generate the
proper AF defines according selected pins 
*******************************************************************************/
#undef GPIOA
#undef GPIOB
#undef GPIOC
#undef GPIOD
#undef GPIOE
#undef GPIOF

#define GPIOA 100
#define GPIOB 101
#define GPIOC 102
#define GPIOD 103
#define GPIOE 104
#define GPIOF 105

#undef GPIO_Pin_0
#undef GPIO_Pin_1
#undef GPIO_Pin_2
#undef GPIO_Pin_3
#undef GPIO_Pin_4
#undef GPIO_Pin_5
#undef GPIO_Pin_6
#undef GPIO_Pin_7
#undef GPIO_Pin_8
#undef GPIO_Pin_9
#undef GPIO_Pin_10
#undef GPIO_Pin_11
#undef GPIO_Pin_12
#undef GPIO_Pin_13
#undef GPIO_Pin_14
#undef GPIO_Pin_15

#define GPIO_Pin_0  200
#define GPIO_Pin_1  201
#define GPIO_Pin_2  202
#define GPIO_Pin_3  203
#define GPIO_Pin_4  204
#define GPIO_Pin_5  205
#define GPIO_Pin_6  206
#define GPIO_Pin_7  207
#define GPIO_Pin_8  208
#define GPIO_Pin_9  209
#define GPIO_Pin_10 210
#define GPIO_Pin_11 211
#define GPIO_Pin_12 212
#define GPIO_Pin_13 213
#define GPIO_Pin_14 214
#define GPIO_Pin_15 215

/* TIM 2 - CH1*/
#if ((H1_GPIO_PORT == GPIOA) && (H1_GPIO_PIN == GPIO_Pin_0))
#define H1_GPIO_AF GPIO_AF_1
#endif
#if ((H1_GPIO_PORT == GPIOA) && (H1_GPIO_PIN == GPIO_Pin_5))
#define H1_GPIO_AF GPIO_AF_1
#endif
#if ((H1_GPIO_PORT == GPIOA) && (H1_GPIO_PIN == GPIO_Pin_15))
#define H1_GPIO_AF GPIO_AF_1
#endif
#if ((H1_GPIO_PORT == GPIOD) && (H1_GPIO_PIN == GPIO_Pin_3))
#define H1_GPIO_AF GPIO_AF_2
#endif

/* TIM 3 - CH1*/
#if ((H1_GPIO_PORT == GPIOA) && (H1_GPIO_PIN == GPIO_Pin_6))
#define H1_GPIO_AF GPIO_AF_2
#endif
#if ((H1_GPIO_PORT == GPIOB) && (H1_GPIO_PIN == GPIO_Pin_4))
#define H1_GPIO_AF GPIO_AF_2
#endif
#if ((H1_GPIO_PORT == GPIOC) && (H1_GPIO_PIN == GPIO_Pin_6))
#define H1_GPIO_AF GPIO_AF_2
#endif
#if ((H1_GPIO_PORT == GPIOE) && (H1_GPIO_PIN == GPIO_Pin_2))
#define H1_GPIO_AF GPIO_AF_2
#endif

/* TIM 4 - CH1*/
#if ((H1_GPIO_PORT == GPIOA) && (H1_GPIO_PIN == GPIO_Pin_11))
#define H1_GPIO_AF GPIO_AF_10
#endif
#if ((H1_GPIO_PORT == GPIOB) && (H1_GPIO_PIN == GPIO_Pin_6))
#define H1_GPIO_AF GPIO_AF_2
#endif
#if ((H1_GPIO_PORT == GPIOD) && (H1_GPIO_PIN == GPIO_Pin_12))
#define H1_GPIO_AF GPIO_AF_2
#endif

/* TIM 2 - CH2*/
#if ((H2_GPIO_PORT == GPIOA) && (H2_GPIO_PIN == GPIO_Pin_1))
#define H2_GPIO_AF GPIO_AF_1
#endif
#if ((H2_GPIO_PORT == GPIOB) && (H2_GPIO_PIN == GPIO_Pin_3))
#define H2_GPIO_AF GPIO_AF_1
#endif
#if ((H2_GPIO_PORT == GPIOD) && (H2_GPIO_PIN == GPIO_Pin_4))
#define H2_GPIO_AF GPIO_AF_2
#endif

/* TIM 3 - CH2*/
#if ((H2_GPIO_PORT == GPIOA) && (H2_GPIO_PIN == GPIO_Pin_4))
#define H2_GPIO_AF GPIO_AF_2
#endif
#if ((H2_GPIO_PORT == GPIOA) && (H2_GPIO_PIN == GPIO_Pin_7))
#define H2_GPIO_AF GPIO_AF_2
#endif
#if ((H2_GPIO_PORT == GPIOB) && (H2_GPIO_PIN == GPIO_Pin_5))
#define H2_GPIO_AF GPIO_AF_2
#endif
#if ((H2_GPIO_PORT == GPIOC) && (H2_GPIO_PIN == GPIO_Pin_7))
#define H2_GPIO_AF GPIO_AF_2
#endif
#if ((H2_GPIO_PORT == GPIOE) && (H2_GPIO_PIN == GPIO_Pin_3))
#define H2_GPIO_AF GPIO_AF_2
#endif

/* TIM 4 - CH2*/
#if ((H2_GPIO_PORT == GPIOA) && (H2_GPIO_PIN == GPIO_Pin_12))
#define H2_GPIO_AF GPIO_AF_10
#endif
#if ((H2_GPIO_PORT == GPIOB) && (H2_GPIO_PIN == GPIO_Pin_7))
#define H2_GPIO_AF GPIO_AF_2
#endif
#if ((H2_GPIO_PORT == GPIOD) && (H2_GPIO_PIN == GPIO_Pin_13))
#define H2_GPIO_AF GPIO_AF_2
#endif

/* TIM 2 - CH3*/
#if ((H3_GPIO_PORT == GPIOA) && (H3_GPIO_PIN == GPIO_Pin_2))
#define H3_GPIO_AF GPIO_AF_1
#endif
#if ((H3_GPIO_PORT == GPIOA) && (H3_GPIO_PIN == GPIO_Pin_9))
#define H3_GPIO_AF GPIO_AF_10
#endif
#if ((H3_GPIO_PORT == GPIOB) && (H3_GPIO_PIN == GPIO_Pin_10))
#define H3_GPIO_AF GPIO_AF_1
#endif
#if ((H3_GPIO_PORT == GPIOD) && (H3_GPIO_PIN == GPIO_Pin_7))
#define H3_GPIO_AF GPIO_AF_2
#endif

