SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F30x.h
/* TIM 3 - CH3*/
#if ((H3_GPIO_PORT == GPIOB) && (H3_GPIO_PIN == GPIO_Pin_0))
#define H3_GPIO_AF GPIO_AF_2
#endif
#if ((H3_GPIO_PORT == GPIOC) && (H3_GPIO_PIN == GPIO_Pin_8))
#define H3_GPIO_AF GPIO_AF_2
#endif
#if ((H3_GPIO_PORT == GPIOE) && (H3_GPIO_PIN == GPIO_Pin_4))
#define H3_GPIO_AF GPIO_AF_2
#endif

/* TIM 4 - CH3*/
#if ((H3_GPIO_PORT == GPIOA) && (H3_GPIO_PIN == GPIO_Pin_13))
#define H3_GPIO_AF GPIO_AF_10
#endif
#if ((H3_GPIO_PORT == GPIOB) && (H3_GPIO_PIN == GPIO_Pin_8))
#define H3_GPIO_AF GPIO_AF_2
#endif
#if ((H3_GPIO_PORT == GPIOD) && (H3_GPIO_PIN == GPIO_Pin_14))
#define H3_GPIO_AF GPIO_AF_2
#endif

#undef GPIOA
#undef GPIOB
#undef GPIOC
#undef GPIOD
#undef GPIOE
#undef GPIOF
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)

#undef GPIO_Pin_0
#undef GPIO_Pin_1
#undef GPIO_Pin_2
#undef GPIO_Pin_3
#undef GPIO_Pin_4
#undef GPIO_Pin_5
#undef GPIO_Pin_6
#undef GPIO_Pin_7
#undef GPIO_Pin_8
#undef GPIO_Pin_9
#undef GPIO_Pin_10
#undef GPIO_Pin_11
#undef GPIO_Pin_12
#undef GPIO_Pin_13
#undef GPIO_Pin_14
#undef GPIO_Pin_15
#define GPIO_Pin_0                 ((uint16_t)0x0001)  /*!< Pin 0 selected    */
#define GPIO_Pin_1                 ((uint16_t)0x0002)  /*!< Pin 1 selected    */
#define GPIO_Pin_2                 ((uint16_t)0x0004)  /*!< Pin 2 selected    */
#define GPIO_Pin_3                 ((uint16_t)0x0008)  /*!< Pin 3 selected    */
#define GPIO_Pin_4                 ((uint16_t)0x0010)  /*!< Pin 4 selected    */
#define GPIO_Pin_5                 ((uint16_t)0x0020)  /*!< Pin 5 selected    */
#define GPIO_Pin_6                 ((uint16_t)0x0040)  /*!< Pin 6 selected    */
#define GPIO_Pin_7                 ((uint16_t)0x0080)  /*!< Pin 7 selected    */
#define GPIO_Pin_8                 ((uint16_t)0x0100)  /*!< Pin 8 selected    */
#define GPIO_Pin_9                 ((uint16_t)0x0200)  /*!< Pin 9 selected    */
#define GPIO_Pin_10                ((uint16_t)0x0400)  /*!< Pin 10 selected   */
#define GPIO_Pin_11                ((uint16_t)0x0800)  /*!< Pin 11 selected   */
#define GPIO_Pin_12                ((uint16_t)0x1000)  /*!< Pin 12 selected   */
#define GPIO_Pin_13                ((uint16_t)0x2000)  /*!< Pin 13 selected   */
#define GPIO_Pin_14                ((uint16_t)0x4000)  /*!< Pin 14 selected   */
#define GPIO_Pin_15                ((uint16_t)0x8000)  /*!< Pin 15 selected   */
/*******************************************************************************
Block ends here 
*******************************************************************************/

#endif /*__PARAMETERS_CONVERSION_F30X_H*/

/******************* (C) COPYRIGHT 2016 STMicroelectronics *****END OF FILE****/
